let sentences=[], choices=[];

function QandA(arr){
	if(arr[0]){
		sentences.push('li憲法に書かれていない(明文化されていない)neが、[幸福追求権](coj13;)や[個人の尊重](coj13;:人格権)、[生存権](coj25;)を根拠として求められている権利をまとめて[新しい人権]という。','[環境権]や人格権が争点となった、飛行機の騒音が問題視された裁判は[大阪空港公害訴訟/大阪空港騒音公害訴訟]である。','[環境アセスメント法/環境影響評価法]…1997年に制定された、開発が環境にもたらす影響について事前に評価するという内容の法律','多くの都道府県・市町村が[情報公開条例]を制定したことに続き1999年に国が制定した、政府の[説明責任](アカウンタビリティ)は明らかにしたが[知る権利](=li国民が、政府や地方公共団体が持っている事情を得る権利ne)の保障についての規定はされていない、行政文書の原則公開を義務付けた法律を[情報公開法]という。','[外務省秘密漏洩事件]…沖縄返還協定に関する密約を外務省職員から入手し報道した新聞記者が告訴され、最高裁は有罪の判決を下した裁判');
		choices.push('参政権,平等権,知る権利','知る権利,司法権,名古屋新幹線公害訴訟,鞆の浦景観訴訟','','地方自治法,自由放任,政治的無関心,プライバシーの権利,知る法律','');
		sentences.push('①防衛, ②外交, ③スパイ行為等の防止, ④テロリズムの防止 に関する情報の漏洩を防ぐために2013年に成立したが、国民の知る権利が侵害される、適正評価の際に[プライバシー]の侵害のおそれがあるなどといった問題点が批判されている法律を[特定秘密保護法]という。','新しい人権のひとつで、マスメディアで意見表明する権利は[アクセス権]である。','1964年三島由紀夫の小説をめぐる裁判(=[『宴のあと』事件/宴のあと事件])で「私生活をみだりに公開されない%…権利」としてli認められne、Google社が「[忘れられる権利]」を主張して個人情報削除申請の受付を開始したことなど、情報化に伴いli「自己に関する情報を自らコントロールする権利」neという広い意味でとらえられるようになった権利は[プライバシーの権利]である。','[プライバシーの権利]と表現の自由(coj21;)が争点となった、柳美里の小説のモデルとされた女性が1999年に請求した損害賠償と小説の出版差し止めが2002年に認められた裁判は[『石に泳ぐ魚』事件/石に泳ぐ魚事件]である。','1999年の[住民基本台帳法]により、2002年に[住民基本台帳ネットワーク](住基ネット)の稼働が始まった。');
		choices.push('知的財産権,違憲審査権,個人情報保護法','','『石に泳ぐ魚』事件,肖像権,知的財産権,アクセス権','黙秘権,請願権,『はだしのゲン』事件,『宴のあと』事件,『沈黙の春』事件','住基コード,マイナンバー制度,住民基本カード');
		sentences.push('犯罪捜査のための電話の盗聴などが認められた法律は[通信傍受法]である。','li個人情報取扱業者を規制したneものであったが、その「個人情報取扱業者」の範囲が曖昧さなどの問題もあった、2003年に制定され後に改正された法律は[個人情報保護法]である。','住民票を有する全員に12桁の個人番号を付して情報を管理する制度は[マイナンバー制度]である。','行政職員による個人情報ファイルの漏洩や個人情報の収集などを規制した、2003年に制定された法律は[行政機関個人情報保護法]である。','2000年、[エホバの証人輸血拒否事件]をめぐって最高裁がli認めたne、[インフォームド・コンセント/インフォームドコンセント]や尊厳死など、新しい人権のひとつで、一定の私的な事柄について他人に干渉されない権利のことを特に[自己決定権]という。');
		choices.push('','','','','パターナリズム,家父長主義,セカンド・オピニオン,自由権');
		sentences.push('li憲法前文neには明記されているものの、上級審の判例がないためli認められていないne、「恐怖と欠乏から免かれ、平和のうちに生存する権利」を[平和的生存権]という。','<span style="color:#f00;font-weight:bold;">※ 私の技術の問題により、順不同にはできなかったんで、頑張って順番もあわせて。よろしく</span><br>ファシズムによる人権弾圧の経験などからli人権国際法が発展neしていったね。ところで、アメリカ大統領フランクリン・ルーズベルトが提唱したli4つの自由neとは、{言論と表現の自由}, {信仰の自由}, {欠乏からの自由}, {恐怖からの自由}である。','1948年の第3回国連総会ではli法的拘束力を持たないne[世界人権宣言]が採択、1966年には1950年のヨーロッパ人権条約を手本として「[社会権規約]li(A規約)ne」「[自由権規約]li(B規約)ne」li「選択議定書」neからなる[国際人権規約]が採択されたが、li日本はA規約については一部留保、選択議定書は未批准neである。','思想・信条を理由に投獄された[良心の囚人]を救済する[アムネスティ・インターナショナル/アムネスティー・インターナショナル/アムネスティインターナショナル/アムネスティーインターナショナル]や、災害に苦しむ人々の救済や人権侵害への証言活動を行う[国境なき医師団]、貧困解消やマイノリティの権利回復といった公正な社会の実現をめざす[オックスファム・インターナショナル/オックスファムインターナショナル]などの団体を[NGO/ＮＧＯ](非政府組織)という。','日本は、1951年に国連で採択された[難民条約]に1981年に批准しているものの、li政治難民は認めるが経済難民は認めないneなど、消極的な姿勢でいる。');
		choices.push('','居住と移転の自由,検閲の自由,精神の自由,拷問からの自由,差別からの自由','子どもの権利条約,フランス人権宣言,生存権規約,平等権規約,死刑廃止条約','アーティフィシャル・インテリジェンス,ルイ・パスツール,オックスフォード・イミグラント,NPO,UNCHR','');
		sentences.push('[ノン・ルフールマンの原則/ノンルフールマンの原則]とは、難民を再び危険のある国へ送還してはならないというものである。','[ヘイトスピーチ対策法]は、人種や性別、容姿、障がいなどに基づいて人や集団を侮辱・攻撃するような発言を禁止する法律であるが、表現の自由を根拠として罰則規定がないことや対象範囲が狭いなどの問題がある。','1979年に国連で採択され日本が1985年に批准した[女性差別撤廃条約]は1985年の[男女雇用機会均等法]の制定につながり、[父母両系]血統主義への変更などが行われた。','1989年に採択された[子どもの権利条約]や1965年に採択された[人種差別撤廃条約]は日本も批准しているが、それに伴った国内法の整備はされていない。','民族や人種集団の大量殺戮を禁止する[ジェノサイド禁止条約]や[死刑廃止条約/死刑撤廃条約]に関しては、日本は批准していない。');
		choices.push('','','子どもの権利条約,U18宣言,男女共同参画社会基本法,夫婦別産制,個人の尊厳,両性の本質的平等','難民条約,南京条約,女性差別撤廃条約,部落差別撤廃条約,','ジェネリック禁止条約,ジェスチャー禁止条約,強要禁止条約,拷問禁止条約');
		sentences.push('coj9;のおはなし。<br>第1項：[戦争放棄]<br>第2項：[戦力の不保持/戦力不保持]','[平和的生存権]…憲法前文「恐怖と欠乏から免かれ、平和のうちに生存する権利」','国家の政策の手段としての戦争を放棄するという内容の条約は[不戦条約](ブリアン・ケロッグ協定)である。','武力による威嚇または武力の行使を原則禁止とし、国家の自衛権や集団的自衛権は容認している、1945年に発効された条約は[国連憲章/国際連合憲章]である。','[冷戦]li(米ソ対立,東西問題)neが激化し1950年に[朝鮮戦争]が始まると、li日本の非軍事化、民主化neが進む一方でマッカーサーの指令によって[警察予備隊]が創設された。');
		choices.push('国民主権,基本的人権の尊重,交戦権の否認','','','','イラク戦争,湾岸戦争,物理的強制力,GHQ');
		sentences.push('1951年に[サンフランシスコ平和条約]が結ばれ日本の主権が回復するとともに、[日米安全保障条約/日米安保条約]によって米軍の日本駐留が決まった。','1952年には[警察予備隊]が[保安隊]に、翌々年にはそれが[自衛隊]に改組された。','1951年の日米安保条約に対して[安保闘争/安保反対闘争]が起きたことから、1960年、li米軍の日本防衛義務neやli事前協議制neなどが明記された新安保条約が締結された。','1960年に[日米地位協定]が締結され、これによりli米軍の基地内での治外法権を認めるneなど米軍の法的地位が定められた。','1989年のマルタ会談によるli冷戦の終結ne、1991年のliソ連解体neは知ってるよね。ところで、1992年にPKO([国連平和維持活動/国際連合平和維持活動])協力法が成立し、同年、liカンボジアへ陸上自衛隊が派遣neされた。');
		choices.push('ベルサイユ平和条約,パリ平和条約,日米和親条約,日米修好通商条約','実力隊,戦力隊,権威隊,物理的強制隊','','','');
		sentences.push('1996年、[日米安保共同宣言]が発表され、(米軍の?)li防衛範囲がアジア・太平洋へ拡大neなどli日米安保条約の再定義neがされた。','1999年に成立した[周辺事態法]により、[周辺事態](li日本の平和及び安全に重要な影響を与える事態ne)に対して自衛隊がli米軍の後方支援neや機雷除去などを行うことになった。','2001年9月11日のアメリカ同時多発テロを契機としたNATO軍のアフガニスタン攻撃に対応して[テロ対策特別措置法]が成立し、これによりli海上自衛隊給油艦がインド洋に派遣neされた。','2003年のイラク戦争に対応して[イラク復興支援特別措置法]が制定され、li人道支援のため陸上自衛隊がイラクに派遣neされた。','首相が知事に代わって命令する代執行権などを明記した[武力攻撃事態対処法]を含む有事関連三法が2003年に成立、翌年には有事関連七法が成立し、そのひとつである[国民保護法]は武力攻撃を受けた際の住民の避難や救護の手続きなどを定めている。');
		choices.push('','地方自治法,地方自治,治安維持法,治安維持','','','武力攻撃特別措置法,国民避難法');
		sentences.push('<tr><th>争点</th><th>事件・訴訟</th><th colspan="2">判決</th></tr><tr><th rowspan="2">li<span class="ib">日米</span><span class="ib">安保</span><span class="ib">条約</span>ne</th><th rowspan="2" class="sosho">[砂川事件]</th><td class="number">①</td><td>違憲</td></tr><tr><td class="number">②</td><td>[統治行為論]</td></tr><tr><th rowspan="6">[自衛隊]</th><th rowspan="3" class="sosho">li<span class="ib">長沼</span><span class="ib">ナイキ</span><span class="ib">基地</span><span class="ib">訴訟</span>ne</th><td class="number">①</td><td>li<b>違憲</b>ne</td></tr><tr><td class="number">②</td><td>[統治行為論]</td></tr><tr><td class="number">高</td><td>(上告棄却)</td></tr><tr><th rowspan="3" class="sosho"><span class="ib">百里</span><span class="ib">基地</span><span class="ib">訴訟</span></th><td class="number">①</td><td>[統治行為論]</td></tr><tr><td class="number">②</td><td>(控訴棄却)</td></tr><tr><td class="number">高</td><td>(上告棄却)</td></tr>');
		choices.push('大津事件,恵庭事件,死刑,差別');
		sentences.push('自衛隊の最高指揮監督権は[文民]である[内閣総理大臣]が有し、このことを[シビリアン・コントロール/シビリアンコントロール]li(文民統制)neという。','国防に関する重要事項の決定は、[内閣総理大臣]が議長を務める[国家安全保障会議]で審議される。','政府は自衛隊について、武力攻撃を受けたときのみ防衛力を行使し、それも自衛のための必要最小限にとどめる[専守防衛]という方針をとっている。','[非核三原則]とは、li核兵器を「持たず、作らず、持ちこませず」neという日本の政策である。');
		choices.push('天皇,間接民主制,防衛大臣,副総理','防衛大臣,官房長官,閣議,審査委員会,党首討論','','');
	}
	if(arr[1]){
		sentences.push('日本は、国民が選挙で選んだ代表者が政治を行う[議会制民主主義/代表民主制/間接民主制/代議制]をとっている。','日本国憲法前文。「日本国民は正当に選挙された[国会における代表者]を通じて行動し」「その権力は[国民]の代表者がこれを行使し」','coj41;「国会は[国権の最高機関]であつて、[国の唯一の立法機関]である。」','日本国憲法は、立法、行政、司法による権力相互の[抑制と均衡/チェック・アンド・バランス/チェックアンドバランス/checks and balances]によって権力濫用を防ぐ[権力分立/三権分立/三権分立制]を採用している。','国会が衆議院と参議院に分かれている[二院制/両院制]や、地方公共団体を住民が運営する[地方自治]を確立することは、li広い意味では権力分立のひとつneであると考えることもできる。');
		choices.push('','','','法の支配,両院制,鉄のトライアングル','多党制,二大政党制,連立政権,地方交付金,民主主義の学校');
		// sentences.push('','','','','');
		// choices.push('','','','','');
	}
	if(arr[2]){
		sentences.push('政治上の理想や目的が同じ人々が政権獲得を目指して結成する団体を[政党]という。'/*,'','','',''*/);
		choices.push(''/*,'','','',''*/);
		// sentences.push('','','','','');
		// choices.push('','','','','');
	}
	// console.log(sentences.length==choices.length);
}