"use strict";

let dakuonToSeion={'が':'か', 'ぎ':'き', 'ぐ':'く', 'げ':'け', 'ご':'こ', 'ざ':'さ', 'じ':'し', 'ず':'す', 'ぜ':'せ', 'ぞ':'そ', 'だ':'た', 'ぢ':'ち', 'づ':'つ', 'で':'て', 'ど':'と', 'ば':'は', 'び':'ひ', 'ぶ':'ふ', 'べ':'へ', 'ぼ':'ほ'};

function kuData(ks){
	if(ks==0){
		let kaminoku=[];
		kaminoku.push("あきのたの かりほのいほの とまをあらみ","はるすぎて なつきにけらし しろたへの","あしびきの やまどりのをの しだりをの","たごのうらに うちいでてみれば しろたへの","おくやまに もみぢふみわけ なくしかの");
		kaminoku.push("かささぎの わたせるはしに おくしもの","あまのはら ふりさけみれば かすがなる","わがいほは みやこのたつみ しかぞすむ","はなのいろは うつりにけりな いたづらに","これやこの ゆくもかへるも わかれては");
		kaminoku.push("わたのはら やそしまかけて こぎいでぬと","あまつかぜ くものかよひぢ ふきとぢよ","つくばねの みねよりおつる みなのがは","みちのくの しのぶもじずり たれゆゑに","きみがため はるののにいでて わかなつむ");
		kaminoku.push("たちわかれ いなばのやまの みねのおふる","ちはやぶる かみよもきかず たつたがは","すみのえの きしによるなみ よるさへや","なにはがた みじかきあしの ふしのまも","わびぬれば いまはたおなじ なにはなる");
		kaminoku.push("いまこむと いひしばかりに ながつきの","ふくからに あきのくさきの しをるれば","つきみれば ちぢにものこそ かなしけれ","このたびは ぬさもとりあへず たむけやま","なにしおはば あふさかやまの さねかづら");
		kaminoku.push("をぐらやま みねのもみぢば こころあらば","みかのはら わきてながるる いづみがは","やまざとは ふゆぞさびしさ まさりける","こころあてに をらばやをらむ はつしもの","ありあけの つれなくみえし わかれより");
		kaminoku.push("あさぼらけ ありあけのつきと みるまでに","やまがはに かぜのかけたる しがらみは","ひさかたの ひかりのどけき はるのひに","たれをかも しるひとにせむ たかさごの","ひとはいさ こころもしらず ふるさとは");
		kaminoku.push("なつのよは まだよひながら あけぬるを","しらつゆに かぜのふきしく あきののは","わすらるる みをばおもはず ちかいてし","あさぢふの をののしのはら しのぶれど","しのぶれど いろにいでにけり わがこひは");
		kaminoku.push("こひすてふ わがなはまだき たちにけり","ちぎりきな かたみにそでを しぼりつつ","あひみての のちのこころに くらぶれば","あふことの たえてしなくは なかなかに","あはれとも いふべきひとは おもほえで");
		kaminoku.push("ゆらのとを わたるふなびと かぢをたえ","やへむぐら しげれるやどの さびしきに","かぜをいたみ いはうつなみの おのれのみ","みかきもり ゑじのたくひの よるはもえ","きみがため をしからざりし いのちさへ");
		kaminoku.push("かくとだに えやはいぶきの さしもぐさ","あけぬれば くるるものとは しりながら","なげきつつ ひとりぬるよの あくるまは","わすれじの ゆくすゑまでは かたければ","たきのおとは たえてひさしく なりぬれど");
		kaminoku.push("あらざらむ このよのほかの おもひでに","めぐりあひて みしやそれとも わかぬまに","ありまやま ゐなのささはら かぜふけば","やすらはで ねなましものを さよふけて","おほえやま いくののみちの とほければ");
		kaminoku.push("いにしへの ならのみやこの やへざくら","よをこめて とりのそらねは はかるとも","いまはただ おもひたえなむ とばかりを","あさぼらけ うぢのかはぎり たえだえに","うらみわび ほさぬそでだに あるものを");
		kaminoku.push("もろともに あはれとおもへ やまざくら","はるのよの ゆめばかりなる たまくらに","こころにも あらでうきよに ながらへば","あらしふく みむろのやまの もみぢばは","さびしさに やどをたちいでて ながむれば");
		kaminoku.push("ゆふされば かどたのいなば おとづれて","おとにきく たかしのはまの あだなみは","たかさごの をのへのさくら さきにけり","うかりける ひとをはつせの やまおろしよ","ちぎりおきし させもがつゆを いのちにて");
		kaminoku.push("わたのはら こぎいでてみれば ひさかたの","せをはやみ いはにせかるる たきがはの","あはぢしま かよふちどりの なくこゑに","あきかぜに たなびくくもの たえまより","ながからむ こころもしらず くろかみの");
		kaminoku.push("ほととぎす なきつるかたを ながむれば","おもひわび さてもいのちは あるものを","よのなかよ みちこそなけれ おもひいる","ながらへば またこのごろや しのばれむ","よもすがら ものおもふころは あけやらで");
		kaminoku.push("なげけとて つきやはものを おもはする","むらさめの つゆもまだひぬ まきのはに","なにはえの あしのかりねの ひとよゆゑ","たまのをよ たえねばたえね ながらへば","みせばやな をじまのあまの そでだにも");
		kaminoku.push("きりぎりす なくやしもよの さむしろに","わがそでは しほひにみえぬ おきのいしの","よのなかは つねにもがもな なぎさこぐ","みよしのの やまのあきかぜ さよふけて","おほけなく うきよのたみに おほふかな");
		kaminoku.push("はなさそふ あらしのにはの ゆきならで","こぬひとを まつほのうらの ゆふなぎに","かぜそよぐ ならのをがはの ゆふぐれは","ひともをし ひともうらめし あぢきなく","ももしきや ふるきのきばの しのぶにも");
		return kaminoku;
	}
	if(ks==1){
		let shimonoku=[];
		shimonoku.push("わがころもでは つゆにぬれつつ","ころもほすてふ あまのかぐやま","ながながしよを ひとりかもねむ","ふじのたかねに ゆきはふりつつ","こゑきくときぞ あきはかなしき");
		shimonoku.push("しろきをみれば よぞふけにける","みかさのやまに いでしつきかも","よをうぢやまと ひとはいふなり","わがみよにふる ながめせしまに","しるもしらぬも あふさかのせき");
		shimonoku.push("ひとにはつげよ あまのつりぶね","をとめのすがた しばしとどめむ","こひぞつもりて ふちとなりぬる","みだれそめにし われならなくに","わがころもでに ゆきはふりつつ");
		shimonoku.push("まつとしきかば いまかへりこむ","からくれなゐに みづくくるとは","ゆめのかよひぢ ひとめよくらむ","あはでこのよを すぐしてよとや","みをつくしても あはむとぞおもふ");
		shimonoku.push("ありあけのつきを まちいでつるかな","むべやまかぜを あらしといふらむ","わがみひとつの あきにはあらねど","もみぢのにしき かみのまにまに","ひとにしられで くるよしもがな");
		shimonoku.push("いまひとたびの みゆきまたなむ","いつみきとてか こひしかるらむ","ひとめもくさも かれぬとおもへば","おきまどはせる しらぎくのはな","あかつきばかり うきものはなし");
		shimonoku.push("よしののさとに ふれるしらゆき","ながれもあへぬ もみぢなりけり","しづごころなく はなのちるらむ","まつもむかしの ともならなくに","はなぞむかしの かににほひける");
		shimonoku.push("くものいづこに つきやどるらむ","つらぬきとめぬ たまぞちりける","ひとのいのちの をしくもあるかな","あまりてなどか ひとのこひしき","ものやおもふと ひとのとふまで");
		shimonoku.push("ひとしれずこそ おもひそめしか","すゑのまつやま なみこさじとは","むかしはものを おもはざりけり","ひとをもみをも うらみざらまし","みのいたづらに なりぬべきかな");
		shimonoku.push("ゆくへもしらぬ こひのみちかな","ひとこそみえね あきはきにけり","くだけてものを おもふころかな","ひるはきえつつ ものをこそおもへ","ながくもがなと おもひけるかな");
		shimonoku.push("さしもしらじな もゆるおもひを","なほうらめしき あさぼらけかな","いかにひさしき ものとかはしる","けふをかぎりの いのちともがな","なこそながれて なほきこえけれ");
		shimonoku.push("いまひとたびの あふこともがな","くもがくれにし よはのつきかな","いでそよひとを わすれやはする","かたぶくまでの つきをみしかな","まだふみもみず あまのはしだて");
		shimonoku.push("けふここのへに にほひぬるかな","よにあふさかの せきはゆるさじ","ひとづてならで いふよしもがな","あらはれわたる せぜのあじろぎ","こひにくちなむ なこそをしけれ");
		shimonoku.push("はなよりほかに しるひともなし","かひなくたたむ なこそをしけれ","こひしかるべき よはのつきかな","たつたのかはの にしきなりけり","いづこもおなじ あきのゆふぐれ");
		shimonoku.push("あしのまろやに あきかぜぞふく","かけじやそでの ぬれもこそすれ","とやまのかすみ たたずもあらなむ","はげしかれとは いのらぬものを","あはれことしの あきもいぬめり");
		shimonoku.push("くもゐにまがふ おきつしらなみ","われてもすゑに あはむとぞおもふ","いくよねざめぬ すまのせきもり","もれいづるつきの かげのさやけさ","みだれてけさは ものをこそおもへ");
		shimonoku.push("ただありあけの つきぞのこれる","うきにたへぬは なみだなりけり","やまのおくにも しかぞなくなる","うしとみしよぞ いまはこひしき","ねやのひまさへ つれなかりけり");
		shimonoku.push("かこちがほなる わがなみだかな","きりたちのぼる あきのゆふぐれ","みをつくしてや こひわたるべき","しのぶることの よわりもぞする","ぬれにぞぬれし いろはかはらず");
		shimonoku.push("ころもかたしき ひとりかもねむ","ひとこそしらね かわくまもなし","あまのをぶねの つなでかなしも","ふるさとさむく ころもうつなり","わがたつそまに すみぞめのそで");
		shimonoku.push("ふりゆくものは わがみなりけり","やくやもしほの みもこがれつつ","みそぎぞなつの しるしなりける","よをおもふゆゑに ものおもふみは","なほあまりある むかしなりけり");
		return shimonoku;
	}
	return["oh hi :D"];
}
